{
  "status": "success",
  "totalResults": 52,
  "results": [
      {
          "title": "The Ukrainian PS4 Farm Was Actually Grinding 'FIFA' Ultimate Team Accounts",
          "link": "http://feedproxy.google.com/~r/hypebeast/feed/~3/qdBEOhHbeaw/",
          "keywords": [
              "Gaming"
          ],
          "creator": null,
          "video_url": null,
          "description": "Last week, Ukrainian authorities busted a massive illegal Sony PlayStation 4 farm for what they believed was a crypto mining operation. As it turns out, the warehouse was actually grinding for FIFA Ultimate Team coins and cards.According to the Ukrainian business journal Delo, which undertook an investigation itself following skepticism from initial findings by the authorities, the 3,800 PS4s discovered weren't actually being used to mine cryptocurrency, which makes sense given how their hardware and graphics cards aren't ideal. It also pointed out that in many photos you can see game discs actually sticking out of the consoles. The Security Service of Ukraine has refused to comment on Delo's findings, explaining that the ongoing investigation must be kept a secret.For those unfamiliar, the Ultimate Team game mode within FIFA allows gamers to build their own custom teams with various player cards. To get better players, you'll have to play and win more matches, giving you in-game currency to buy packs. Alternatively, you can also pay with real currency to buy coins to unlock these packs. On the flip side, the in-game currency earned or cards you obtain can be sold back in black markets for actual money. To give you a sense of just how big this market is, official FIFA Ultimate Team transactions brought in $1.6 billion USD for EA in just the past year.Elsewhere in gaming, eBay is already flooding with listings from Steam Deck scalpers.Click here to view full gallery at HYPEBEAST",
          "content": "Last week, Ukrainian authorities busted a massive illegal Sony PlayStation 4 farm for what they believed was a crypto mining operation. As it turns out, the warehouse was actually grinding for FIFA Ultimate Team coins and cards.According to the Ukrainian business journal Delo, which undertook an investigation itself following skepticism from initial findings by the authorities, the 3,800 PS4s discovered weren't actually being used to mine cryptocurrency, which makes sense given how their hardware and graphics cards aren't ideal. It also pointed out that in many photos you can see game discs actually sticking out of the consoles. The Security Service of Ukraine has refused to comment on Delo's findings, explaining that the ongoing investigation must be kept a secret.For those unfamiliar, the Ultimate Team game mode within FIFA allows gamers to build their own custom teams with various player cards. To get better players, you'll have to play and win more matches, giving you in-game currency to buy packs. Alternatively, you can also pay with real currency to buy coins to unlock these packs. On the flip side, the in-game currency earned or cards you obtain can be sold back in black markets for actual money. To give you a sense of just how big this market is, official FIFA Ultimate Team transactions brought in $1.6 billion USD for EA in just the past year.Elsewhere in gaming, eBay is already flooding with listings from Steam Deck scalpers.Click here to view full gallery at HYPEBEAST",
          "pubDate": "2021-07-19 10:10:27",
          "image_url": null,
          "source_id": "hypebeast"
      },
      {
          "title": "Russian Crypto Industry Scrambles to Attract Miners as Kazakhstan Overtakes Russia in Mining Volume",
          "link": "https://news.bitcoin.com/russian-crypto-industry-scrambles-to-attract-miners-as-kazakhstan-overtakes-russia-in-mining-volume/",
          "keywords": [
              "Mining",
              "association",
              "Crypto",
              "crypto miners",
              "crypto mining",
              "Cryptocurrency",
              "cryptocurrency mining",
              "Electricity",
              "Energy",
              "environment",
              "Hashrate",
              "industry association",
              "Kazakhstan",
              "Miners",
              "mining",
              "Organization",
              "power",
              "project",
              "racib",
              "ranking",
              "Russia",
              "russian",
              "study",
              "volume"
          ],
          "creator": [
              "Lubomir Tassev"
          ],
          "video_url": null,
          "description": "An industry association representing the Russian crypto sector has launched a project to entice bitcoin miners. Despite its abundant sources of cheap energy, Russia is now lagging behind Kazakhstan, another Eurasian Economic Union member, in terms of cryptocurrency production. Russian Project Aims to Expand Country’s Crypto Mining Capacity The Russian Association of Crypto Industry and […]",
          "content": "An industry association representing the Russian crypto sector has launched a project to entice bitcoin miners. Despite its abundant sources of cheap energy, Russia is now lagging behind Kazakhstan, another Eurasian Economic Union member, in terms of cryptocurrency production. Russian Project Aims to Expand Country’s Crypto Mining Capacity The Russian Association of Crypto Industry and Blockchain (Racib) has unveiled a project to bring a larger portion of the global computing potential engaged in cryptocurrency mining to Russia. The Russian Federation, Racib noted in an announcement, ranks among the top five nations by total electricity production. What’s more, the country’s energy system features unique characteristics that can benefit enterprises involved in the minting of digital coins. Racib has listed a number of them, including the large surplus of power-generating capacity which reaches 50% in certain regions. The colder Russian climate is another advantage as it allows the cooling of mining equipment at little cost, thus improving the efficiency of data centers. Add to that the wide availability of traditional fuels and other energy resources, as well as the low population density in many areas that makes it possible to deploy large-scale facilities and infrastructure. Racib emphasizes: All this … provides the best conditions for the formation of specialized clusters in the country to support the global cryptocurrency networks and the infrastructure of the global digital economy. The crypto association says it will implement the project in close cooperation with central and regional Russian authorities and state-run corporations. Several working groups have been established already with the participation of the energy industry and public institutions. The organization claims its main foreign partner in the project is a “consortium of the largest mining companies in China.” Amid an ongoing crackdown on crypto miners in the People’s Republic, Racib hopes some of them will transfer their computing power to the Russian Federation to increase Russia’s share of the global hashrate. if (!window.GrowJs) { (function () { var s = document.createElement('script'); s.async = true; s.type = 'text/javascript'; s.src = 'https://bitcoinads.growadvertising.com/adserve/app'; var n = document.getElementsByTagName(\"script\")[0]; n.parentNode.insertBefore(s, n); }()); } var GrowJs = GrowJs || {}; GrowJs.ads = GrowJs.ads || []; GrowJs.ads.push({ node: document.currentScript.parentElement, handler: function (node) { var banner = GrowJs.createBanner(node, 31, [300, 250], null, []); GrowJs.showBanner(banner.index); } }); Kazakhstan Overtakes Russia as Crypto Mining Destination Environmental concerns are believed to be a major motive behind Beijing’s squeeze on crypto mining and Racib thinks Russia has an answer. Eco-friendly hydro and nuclear energy sources form around 40% of the country’s energy balance. And as far as Bitcoin is concerned, Russia’s involvement in the miners’ migration from China should “provide a more decentralized network format of the main digital currency” and help “avoid another concentration of mining resources in one region, in this case North America.” Chinese miners are already on the move, however, and Russia should hurry up if it wants to lure some of them to its territory. Others have been quicker to take advantage of the shift, including Kazakhstan, another former Soviet Republic, and a member of the Russia-led Eurasian Economic Union (EEU). Evolution of country share in global hashrate (monthly average). Source: University of Cambridge. In less than two years, the Central Asian country has increased its share in the global bitcoin extraction by almost six times, from 1.4% to 8.2%, according to a study conducted by the University of Cambridge. By crypto mining volume, Kazakhstan is now third in the world, the data quoted by RBC (a major Russian business news portal) shows, overtaking Russia which ranks fourth with 6.8%. During the same period, between September 2019 and April of 2021, China’s share has dropped from 75.5% to 46%, while the United States has climbed to second place, increasing its share from 4.1% to 16.8%, the report details. According to the research, the Islamic Republic of Iran is now fifth with 4.6%. Still, Russia has a chance to improve its position as Kazakhstan recently introduced a surcharge for electricity consumed by miners despite opposition from the local crypto industry. Do you think Russia will be able to attract cryptocurrency miners to its jurisdiction? Share your thoughts on the subject in the comments section below.",
          "pubDate": "2021-07-19 09:30:04",
          "image_url": null,
          "source_id": "bitcoin"
      },
      {
          "title": "Ethereum's co-founder says he's done with crypto because it's too risky — and only represents a small bit of what the world needs",
          "link": "https://markets.businessinsider.com/news/cryptocurrencies/ethereum-co-founder-anthony-di-iorio-exit-crypto-personal-safety-2021-7",
          "keywords": null,
          "creator": [
              "Shalini Nagarajan"
          ],
          "video_url": null,
          "description": "Summary List PlacementAnthony Di Iorio, a co-founder of the ethereum blockchain, is wrapping up his time in the cryptocurrency world due to personal safety concerns, and because he no longer wants to be known as the \"crypto guy.\" He recently told Bloomberg he wasn't too encouraged by the risk profile attached to the industry. \"I don't feel necessarily safe in this space,\" he said. \"If I was focused on larger problems, I think I'd be safer.\" The 48-year-old Canadian has had a security team since 2017, and mostly been accompanied on his travels, Bloomberg said. He soon plans to sell his current blockchain venture Decentral to focus on philanthropy and other projects unrelated to crypto. Decentral, founded in 2014, is a Toronto-based wallet and crypto services provider whose flagship product, Jaxx Liberty, counted about 1 million customers this year. Di Iorio, who estimates his startup is worth \"hundreds of millions,\" expects to strike a deal in fiat money, or in equity, rather than in crypto. Forbes lists his own net worth as high as $1 billion.  He further told Bloomberg he wants to transition to being someone who takes on complex problems. He's currently involved with an initiative called Project Arrow which is involved with a zero-emission concept vehicle run by a high-school friend. Di Iorio co-founded ethereum in 2014 along with seven others in Switzerland in a rented house they called the \"spaceship.\" Among them, Vitalik Buterin is the only one still working on the blockchain. Ether, the network's native token and the world's second-largest cryptocurrency, held a market value of $221 billion as of Monday, according to data from coinmarketcap.com. Ether has continued to grow in popularity this year, showing a 53% increase in trading volumes quarter-on-quarter to an average of $3.25 billion a day on global exchanges, a report from Coinbase shows. Meanwhile, bitcoin has seen a 14% decline in the same period to $4.01 billion. \"I will incorporate crypto when needed, but a lot of times, it's not,\" Di Iorio said. \"It's really a small percentage of what the world needs.\" Read More: An $875 mini bitcoin-mining rig is viral on TikTok. The video's creator told us 3 reasons why it's an appealing alternative for crypto traders, and explained its limitations.  Join the conversation about this story » NOW WATCH: Why some Coca-Cola bottles have a yellow cap",
          "content": null,
          "pubDate": "2021-07-19 08:29:00",
          "image_url": "https://static4.businessinsider.com/image/60f52646bc757c001904b96e/ethereums-co-founder-says-hes-done-with-crypto-because-its-too-risky--and-only-represents-a-small-bit-of-what-the-world-needs.jpg",
          "source_id": "businessinsider_us"
      },
      {
          "title": " Cryptocurrency price update: Bitcoin, Ether struggle as bearish momentum continues ",
          "link": " https://www.indiatoday.in/business/story/cryptocurrency-price-update-bitcoin-ether-struggle-as-bearish-momentum-continues-1829902-2021-07-19?utm_source=rss ",
          "keywords": null,
          "creator": null,
          "video_url": null,
          "description": "Cryptocurrency price update: Bitcoin, Ether struggle as bearish momentum continues",
          "content": null,
          "pubDate": "2021-07-19 07:53:57",
          "image_url": null,
          "source_id": "indiatoday"
      },
      {
          "title": "Paraguayan Lawmakers Present a Very Different ‘Bitcoin Bill’ Than Expected",
          "link": "https://news.bitcoin.com/paraguayan-lawmakers-present-a-very-different-bitcoin-bill-than-expected/",
          "keywords": [
              "News",
              "bitcoin bill",
              "carlos rejala",
              "Cryptocurrency",
              "legal tender",
              "mining",
              "nitcoin",
              "Paraguay",
              "trading"
          ],
          "creator": [
              "Sergio Goschenko"
          ],
          "video_url": null,
          "description": "A group of Paraguayan lawmakers presented a ‘Bitcoin bill’ in the National Congress last week, but it turned out to be a very different proposal than what crypto followers expected. The bill seeks to control and regulate cryptocurrency transactions and establish taxes. There is no mention of declaring bitcoin or any other cryptocurrencies as legal […]",
          "content": "A group of Paraguayan lawmakers presented a ‘Bitcoin bill’ in the National Congress last week, but it turned out to be a very different proposal than what crypto followers expected. The bill seeks to control and regulate cryptocurrency transactions and establish taxes. There is no mention of declaring bitcoin or any other cryptocurrencies as legal tender anywhere in the proposal. “Bitcoin Bill” Presented in Paraguay The long-hyped ‘Bitcoin bill’ was at last presented in Paraguay to the National Congress by two lawmakers last week, but it was not what some had anticipated. The project presented by deputy Carlos Rejala and the liberal senator Fernando Silva Facetti doesn’t aim to declare bitcoin as legal tender, as El Salvador did last month. In fact, it states the opposite. An early draft states: “Digital assets are not legal tender currencies used by the Paraguayan State, and for this reason they are not backed by the Central Bank of Paraguay” Instead, the proposed law seeks to regulate crypto transactions for the state to collect taxes for trading and other use cases. The law proposes the Central Bank of Paraguay as the comptroller of all the entities related to cryptocurrencies. Facetti, when consulted about the direction of the proposed law, stated: This is not a legal tender, this is a commodity and the purpose of the law is to regulate and control this industry. That is the base project that we really have today. if (!window.GrowJs) { (function () { var s = document.createElement('script'); s.async = true; s.type = 'text/javascript'; s.src = 'https://bitcoinads.growadvertising.com/adserve/app'; var n = document.getElementsByTagName(\"script\")[0]; n.parentNode.insertBefore(s, n); }()); } var GrowJs = GrowJs || {}; GrowJs.ads = GrowJs.ads || []; GrowJs.ads.push({ node: document.currentScript.parentElement, handler: function (node) { var banner = GrowJs.createBanner(node, 31, [300, 250], null, []); GrowJs.showBanner(banner.index); } }); Mining and Trading Also Regulated The law also mentions bitcoin mining and trading as activities under its scope. Mining-related imports will be taxed with 5% corresponding to an aggregated value tax if the project gets approved. Also, cryptocurrency traders will have to be licensed annually and to-be-created state institutions will carry a record of these. The project states: “Any person whose main activity is that of trader must have an authorization issued by a competent authority, which enables him to carry out consultancies or transactions through a mandate or administration contract. The law describes sanctions for not complying with these mandates, but it doesn’t specify the forms these sanctions would take. If approved, the law would give a period for miners to register with the government and get operational licenses. To conclude, the law mentions the creation of the Digital Securities Fluctuation Reserve Fund, which would aid traders that lose digital assets in the market. What do you think about the newly proposed Paraguayan “bitcoin bill”? Tell us in the comments section below.",
          "pubDate": "2021-07-19 07:30:17",
          "image_url": null,
          "source_id": "bitcoin"
      },
      {
          "title": "Malaysian Authorities Steamroll More Than 1,000 Crypto Mining PCs Worth $1.26 Million USD",
          "link": "http://feedproxy.google.com/~r/hypebeast/feed/~3/t5segTjlYF8/",
          "keywords": [
              "Tech"
          ],
          "creator": null,
          "video_url": null,
          "description": "Malaysian authorities have just crushed $1.26 million USD's worth of cryptocurrency mining PCs with a steamroller.In the Malaysian city of Sarawak, authorities seized 1,069 crypto mining rigs over the course of six raids taken place between February and April this year. The computers were confiscated as part of a crackdown following allegations from Sarawak Energy Berhad, the region's electric utility company, that these operations had stolen roughly $2 million USD in bill payments from the company.Since mining cryptocurrency requires a huge amount of energy, many miners often tap into the electric grid illegally in order to avoid exorbitant costs. Sarawak police chief Hakemal Hawari revealed that this year alone, three houses had already burned down due to illegal electric connections in an effort to steal electricity for mining operations.You can check out a video of the steamrolling above.Elsewhere in tech, Square is creating a new Bitcoin business named \"TBD.\"Read more at HYPEBEAST",
          "content": "Malaysian authorities have just crushed $1.26 million USD's worth of cryptocurrency mining PCs with a steamroller.In the Malaysian city of Sarawak, authorities seized 1,069 crypto mining rigs over the course of six raids taken place between February and April this year. The computers were confiscated as part of a crackdown following allegations from Sarawak Energy Berhad, the region's electric utility company, that these operations had stolen roughly $2 million USD in bill payments from the company.Since mining cryptocurrency requires a huge amount of energy, many miners often tap into the electric grid illegally in order to avoid exorbitant costs. Sarawak police chief Hakemal Hawari revealed that this year alone, three houses had already burned down due to illegal electric connections in an effort to steal electricity for mining operations.You can check out a video of the steamrolling above.Elsewhere in tech, Square is creating a new Bitcoin business named \"TBD.\"Read more at HYPEBEAST",
          "pubDate": "2021-07-19 07:20:38",
          "image_url": null,
          "source_id": "hypebeast"
      },
      {
          "title": "Malaysian Authorities Steamroll More Than 1,000 Crypto Mining PCs Worth $1.26 Million USD",
          "link": "https://hypebeast.com/2021/7/malaysia-steamrolls-cryptocurrency-mining-operation-computers",
          "keywords": [
              "Tech"
          ],
          "creator": null,
          "video_url": null,
          "description": "Malaysian authorities have just crushed $1.26 million USD's worth of cryptocurrency mining PCs with a steamroller.In the Malaysian city of Sarawak, authorities seized 1,069 crypto mining rigs over the course of six raids taken place between February and April this year. The computers were confiscated as part of a crackdown following allegations from Sarawak Energy Berhad, the region's electric utility company, that these operations had stolen roughly $2 million USD in bill payments from the company.Since mining cryptocurrency requires a huge amount of energy, many miners often tap into the electric grid illegally in order to avoid exorbitant costs. Sarawak police chief Hakemal Hawari revealed that this year alone, three houses had already burned down due to illegal electric connections in an effort to steal electricity for mining operations.You can check out a video of the steamrolling above.Elsewhere in tech, Square is creating a new Bitcoin business named \"TBD.\"Read more at HYPEBEAST",
          "content": "Malaysian authorities have just crushed $1.26 million USD's worth of cryptocurrency mining PCs with a steamroller.In the Malaysian city of Sarawak, authorities seized 1,069 crypto mining rigs over the course of six raids taken place between February and April this year. The computers were confiscated as part of a crackdown following allegations from Sarawak Energy Berhad, the region's electric utility company, that these operations had stolen roughly $2 million USD in bill payments from the company.Since mining cryptocurrency requires a huge amount of energy, many miners often tap into the electric grid illegally in order to avoid exorbitant costs. Sarawak police chief Hakemal Hawari revealed that this year alone, three houses had already burned down due to illegal electric connections in an effort to steal electricity for mining operations.You can check out a video of the steamrolling above.Elsewhere in tech, Square is creating a new Bitcoin business named \"TBD.\"Read more at HYPEBEAST",
          "pubDate": "2021-07-19 07:20:38",
          "image_url": null,
          "source_id": "hypebeast"
      },
      {
          "title": "Cryptocurrency LIVE: Bitcoin surges as zig-zagging price stabilises in volatile market",
          "link": "http://feedproxy.google.com/~r/daily-express-citybusiness/~3/ICEFWbV414o/cryptocurrency-live-bitcoin-price-ethereum-dogecoin-price-latest-update-elon-musk",
          "keywords": null,
          "creator": null,
          "video_url": null,
          "description": "BITCOIN'S price has started to pick up momentum and head in the right direction in a major boost for the world's most popular cryptocurrency at the start of the trading week.",
          "content": null,
          "pubDate": "2021-07-19 07:15:20",
          "image_url": null,
          "source_id": "express"
      },
      {
          "title": "TikTok Bans Influencers From Promoting Cryptocurrencies Like Bitcoin, Dogecoin, on Its Platform - Gadgets 360",
          "link": "https://news.google.com/__i/rss/rd/articles/CBMie2h0dHBzOi8vZ2FkZ2V0cy5uZHR2LmNvbS9jcnlwdG9jdXJyZW5jeS9uZXdzL3Rpa3Rvay1iYW5zLWluZmx1ZW5jZXJzLWZyb20tcHJvbW90aW5nLWNyeXB0b2N1cnJlbmN5LWJpdGNvaW4tZG9nZWNvaW4tMjQ4OTYyMdIBkAFodHRwczovL2dhZGdldHMubmR0di5jb20vY3J5cHRvY3VycmVuY3kvbmV3cy90aWt0b2stYmFucy1pbmZsdWVuY2Vycy1mcm9tLXByb21vdGluZy1jcnlwdG9jdXJyZW5jeS1iaXRjb2luLWRvZ2Vjb2luLTI0ODk2MjE_YW1wPTEmYWthbWFpLXJ1bT1vZmY?oc=5",
          "keywords": null,
          "creator": null,
          "video_url": null,
          "description": "TikTok Bans Influencers From Promoting Cryptocurrencies Like Bitcoin, Dogecoin, on Its Platform  Gadgets 360Top cryptocurrency Prices Today: Dogecoin, Ethereum, Uniswap shed up to 6%  Economic TimesView Full coverage on Google News",
          "content": null,
          "pubDate": "2021-07-19 05:42:43",
          "image_url": null,
          "source_id": "google"
      },
      {
          "title": "Japan court hands down jail time for US duo over Ghosn escape",
          "link": "https://www.malaymail.com/news/world/2021/07/19/japan-court-hands-down-jail-time-for-us-duo-over-ghosn-escape/1991016",
          "keywords": [
              "carlos ghosn",
              "michael taylor",
              "japan court",
              "peter taylor"
          ],
          "creator": null,
          "video_url": null,
          "description": "TOKYO, July 19 — A Japan court on Monday sentenced an American father-son duo who helped former Nissan chief Carlos Ghosn flee the country to between 20 months and two years in prison. The sentence is the first handed down in Japan in the Nissan...",
          "content": "This undated combination of file photos March 2, 2021 shows former US special forces member Michael Taylor and his son Peter, posing together years apart at unknown locations. — Taylor family handout pic via AFP Follow us on Instagram and subscribe to our Telegram channel for the latest updates. TOKYO, July 19 — A Japan court on Monday sentenced an American father-son duo who helped former Nissan chief Carlos Ghosn flee the country to between 20 months and two years in prison.The sentence is the first handed down in Japan in the Nissan saga, which began with former auto tycoon Ghosn’s shock arrest in Japan in 2018 on financial misconduct allegations.Former US special forces operative Michael Taylor was sentenced to two years, while his son Peter received a sentence of 20 months.The Taylors did not contest the allegations against them, admitting their role in the audacious escape that left Ghosn an international fugitive in Lebanon.They had been facing up to three years in prison over the escape, which US prosecutors described as “one of the most brazen and well-orchestrated escape acts in recent history”.The pair had both apologised in previous hearings, expressing remorse for helping Ghosn jump bail as he awaited trial in 2019.Japanese prosecutors said earlier this month they were seeking a sentence of two years, 10 months for Michael, and two years, six months for Peter.Their defence lawyers had argued that a suspended sentence was appropriate given their remorse.They also argued that the pair’s 10-month detention in the United States before extradition should be considered in sentencing. The Taylors arrived in Tokyo in March after losing their battle against extradition.At their first hearing, in June, prosecutors described the almost-cinematic details of the operation — including that Ghosn was hidden in a large case with air holes drilled into it to slip past security at an airport.He told the BBC recently about the experience, describing the half-hour in the box waiting for the plane to take off as “probably the longest wait I’ve ever experienced in my life”.A third man, identified as George Antoine Zayek, is also accused of involvement in the escape but remains at large.According to the prosecution, the Ghosn family paid the Taylors more than US$860,000 (RM3.63 million) for preparation and logistical costs, and US$500,000 in cryptocurrency for lawyers’ fees.International falloutGhosn’s escape started with him simply walking out of his luxury central Tokyo residence on December 29, 2019, and taking a shinkansen bullet train to Osaka in western Japan.“There were dozens of people in the carriage, but I was wearing a cap, a facemask and sunglasses. You’d have had to be a real expert to recognise me under all that,” Ghosn wrote in a book published last year.He met Michael Taylor in a hotel in Osaka and was smuggled onto a private jet in the infamous equipment case.Ghosn transited in Turkey before arriving in Lebanon, which has no extradition treaty with Japan and has resisted calls from Tokyo to return the fugitive to face justice.The fallout from the saga that began in 2018 with Ghosn’s spectacular arrest in Tokyo has been vast.Nissan’s CEO was forced out after his own financial irregularities were uncovered in a probe that followed Ghosn’s arrest.Meanwhile, a former Nissan aide to Ghosn, Greg Kelly, is awaiting the verdict in his trial in Japan. He faces up to 10 years in prison if convicted of financial misconduct.And two pilots and another employee of a small private airline in Turkey have been sentenced to four years and two months for their role in Ghosn’s escape.Ghosn himself remains in Lebanon, largely beyond the reach of prosecutors despite active investigations in several countries.In May, he was questioned by French investigators in Lebanon over a series of alleged financial improprieties.But he was only heard as a witness, and would need to be in France to be formally indicted.Ghosn has always denied the financial misconduct allegations made against him, arguing the charges were cooked up by Nissan officials angry about his attempt to further integrate the firm with its French partner Renault.He says he fled Japan because he did not believe he would receive a fair trial, and has not gone to France for fear that he could be extradited to Tokyo. — AFP",
          "pubDate": "2021-07-19 05:26:28",
          "image_url": null,
          "source_id": "malaymail"
      }
  ],
  "nextPage": 1
}